<?php
// //------------------------if conditopm --------------------------
// if (condition) { اگر شرط برقرار بود وارد 
//     # code...
// } else {
//     # code...
// }

$num = 15;
if ($num>=10) {
    echo "pass";
} else {
    echo "failed";
}
//----------------------------- while loop--------------------------
// حلقه هایی هستند که تعداد تکرارشو یا میدونیم یا تعدادشو نمیدونیم 
// while (condition) { 
//     # code...
// }
//------------------------------ for loop ------------------------------
// حلقه هایی هستند که تعداد تکرارشو میدونیم
// for ($i=0; $i < ; $i++) { 
//     # code...
// }
$num = [10,16,17,9,8.75,19,20,5,18,19,10];
$j = sizeof($num);
for ($i=0; $i < $j; $i++) { 
    echo "<br>";
    if ($num[$i]>=10) {
        echo "pass";
    } else {
        echo "failed";
    }
    
}
?>
